Repository: JaimeHyland/django-flutter-i18n-template
Catalog: lib/l10n/app_*.arb
Languages: de, es

# header_welcome
source: Welcome!
de: Willkommen!
es: ¡Bienvenido!

# label_ui_locale
source: Current UI locale
de: Aktuelle Sprache
es: Región (país) actual

# label_ui_language
source: UI Language
de: UI Sprache
es: Idioma de la interfaz

# tooltip_settings
source: Settings
de: Einstellungen
es: Opciones

# header_settings
source: Settings
de: Einstellungen
es: Opciones

# dropdown_ui_locale
source: UI locale
de: Sprache der App
es: Región (país) de la UI

# text_choose_language
source: Select a language
de: Sprache w√§hlen
es: Elije un idioma

# msgFailedToFetchLocales
source: Failed to fetch locales: {error}
de: Fehler beim abrufen der Sprache: {error}
es: Error al obtener idiomas: {error}

# msgFailedToLoadLocale
source: Failed to load locale: {error}
de: Fehler beim laden der Sprache : {error}
es: Error al cargar idioma: {error}

# msgFailedToUpdateLocale
source: Failed to update locale
de: Fehler beim wechseln der Sprache
es: Error al actualizar idioma (país)

# msgCurrentUiLocale
source: Current UI locale: {locale}
de: Sprache aktuell: {locale}
es: Idioma (país) actual: {locale}

# msgLocaleUpdated
source: Locale successfully updated
de: Sprache erfolgreich gewechselt
es: Idioma (país) actualizada

# msgErrorUpdatingLocale
source: Error updating locale: {error}
de: Fehler beim wechseln der Sprache: {error}
es: Error al actualizar idioma (país): {error}

# snapshotUnknown
source: unknown
de: unbekannt
es: desconocido

# msgErrorFetchUserLocale
source: Failed to fetch user locale: {status} {body}
de: Benutzersprache konnte nicht abgerufen werden: {status} {body}
es: No se pudo obtener el idioma (país) de usuario: {status} {body}

# msgErrorFallbackLocale
source: Failed to determine OS fallback locale: {error}
de: Betriebssystem-Ausweichsprache konnte nicht ermittelt werden: {error}
es: No se pudo detectar idioma (páis) alternativa del sistema: {error}

# msgErrorUpdateLocale
source: Failed to update locale: {status}
de: Sprache konnte nicht aktualisiert werden: {status}
es: No se pudo actualizar el idioma (país): {status}

# msgErrorFetchUserSettings
source: Failed to fetch user settings
de: Benutzereinstellungen konnten nicht abgerufen werden
es: No se pudo obtener las opciones del usuario

# msgErrorInitLocale
source: Failed to initialize locale from OS: {error}
de: Sprache konnte nicht vom Betriebssystem initialisiert werden: {error}
es: No se pudo iniciar idioma (país) desde el sistema operario: {error}
